src/giang/test/MoMediaOrderList.xml

<SOAP-ENV:Envelope xmlns:SOAP-ENV="http://schemas.xmlsoap.org/soap/envelope/">
	<SOAP-ENV:Header />
	<SOAP-ENV:Body>
		<ns2:Query xmlns:ns2="urn:xytechsystems.com/XytechAPI"
			xmlns:ns3="http://schemas.datacontract.org/2004/07/Xytech.MP.API"
			xmlns:ns4="http://schemas.microsoft.com/2003/10/Serialization/Arrays"
			xmlns:ns5="http://schemas.datacontract.org/2004/07/Xytech.MP.API/Typed">
			<ns2:credentials>
				<ns3:DBName>VUB_DEV</ns3:DBName>
				<ns3:Password>xytechpw</ns3:Password>
				<ns3:UserID>xytech</ns3:UserID>
			</ns2:credentials>
			<ns2:className>MoMediaOrderList</ns2:className>
			<ns2:criteria>
				<ns3:Criteria>
					<ns3:CriteriaNode>
						<ns3:CompareValues>
							<ns4:string>1510-1</ns4:string>
							<ns4:string>1787-1</ns4:string>
							<ns4:string>1790-1</ns4:string>
							<ns4:string>1797-1</ns4:string>
							<ns4:string>1798-1</ns4:string>
							<ns4:string>1799-1</ns4:string>
							<ns4:string>1800-1</ns4:string>
							<ns4:string>2331-1</ns4:string>
							<ns4:string>2332-1</ns4:string>
							<ns4:string>2338-1</ns4:string>
							<ns4:string>2339-1</ns4:string>
							<ns4:string>2340-1</ns4:string>
							<ns4:string>2341-1</ns4:string>
							<ns4:string>2342-1</ns4:string>
							<ns4:string>2343-1</ns4:string>
							<ns4:string>2344-1</ns4:string>
						</ns3:CompareValues>
						<ns3:IsInequality>false</ns3:IsInequality>
						<ns3:ParamName>wo_no_seq</ns3:ParamName>
					</ns3:CriteriaNode>
					<ns3:CriteriaNode>
						<ns3:MaxValue>2017-07-19T23:59:59.999999999Z</ns3:MaxValue>
						<ns3:MinValue>2017-06-19T00:00Z</ns3:MinValue>
						<ns3:ParamName>wo_begin_dt</ns3:ParamName>
					</ns3:CriteriaNode>
					<ns3:CriteriaNode>
						<ns3:MaxValue>2017-07-19T23:59:59.999999999Z</ns3:MaxValue>
						<ns3:MinValue>2017-06-19T00:00Z</ns3:MinValue>
						<ns3:ParamName>wo_end_dt</ns3:ParamName>
					</ns3:CriteriaNode>
				</ns3:Criteria>
				<ns3:ResultColumns>
					<ns4:string>wo_no_seq</ns4:string>
					<ns4:string>po</ns4:string>
					<ns4:string>cust_id</ns4:string>
					<ns4:string>wo_begin_dt</ns4:string>
					<ns4:string>wo_end_dt</ns4:string>
					<ns4:string>phase_code</ns4:string>
				</ns3:ResultColumns>
			</ns2:criteria>
		</ns2:Query>
	</SOAP-ENV:Body>
</SOAP-ENV:Envelope>